{
  "additional_special_tokens": [
    "[SYNONYM ",
    "[RELATED ",
    "[SIMILAR ",
    "[EXPERIMENTAL ",
    "[SAS ",
    "[WEIGHT ",
    "[TPSA ",
    "[CLOGP ",
    "[QED ",
    "[NUMHDONORS ",
    "[NUMHACCEPTORS ",
    "[NUMHETEROATOMS ",
    "[NUMROTATABLEBONDS ",
    "[NOCOUNT ",
    "[NHOHCOUNT ",
    "[RINGCOUNT ",
    "[HEAVYATOMCOUNT ",
    "[FRACTIONCSP3 ",
    "[NUMAROMATICRINGS ",
    "[NUMSATURATEDRINGS ",
    "[NUMAROMATICHETEROCYCLES ",
    "[NUMAROMATICCARBOCYCLES ",
    "[NUMSATURATEDHETEROCYCLES ",
    "[NUMSATURATEDCARBOCYCLES ",
    "[NUMALIPHATICRINGS ",
    "[NUMALIPHATICHETEROCYCLES ",
    "[NUMALIPHATICCARBOCYCLES ",
    "[IUPAC "
  ],
  "bos_token": "<s>",
  "eos_token": "</s>",
  "pad_token": "<pad>"
}
